M1/paper.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-03-25 Sat 09:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Li Jiajie" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org02995b6">1. 问题的提出</a></li>
<li><a href="#orgd3c530e">2. 问题的分析</a></li>
<li><a href="#org05e0e1d">3. 模型的假设</a></li>
<li><a href="#org1c17bcb">4. 符号说明</a></li>
<li><a href="#org0ca85f4">5. 模型的建立</a></li>
<li><a href="#orgad35e4f">6. 模型的求解</a>
<ul>
<li><a href="#org41206de">6.1. 判断一个地区是否为最大销售量</a></li>
<li><a href="#org31198ef">6.2. 得到各地区的销售量矩阵S</a></li>
<li><a href="#org138dee5">6.3. 计算总利润</a></li>
<li><a href="#orgd9150ee">6.4. 遍历所有可能方案得到最优解</a></li>
</ul>
</li>
<li><a href="#org00e371c">7. 模型分析</a></li>
<li><a href="#org55b601b">8. 模型的推广</a></li>
<li><a href="#org79bfda6">9. 参考文献</a></li>
</ul>
</div>
</div>
<p>
电梯的维修问题
</p>
<div id="outline-container-org02995b6" class="outline-2">
<h2 id="org02995b6"><span class="section-number-2">1</span> 问题的提出</h2>
<div class="outline-text-2" id="text-1">
<p>
复制
</p>
</div>
</div>
<div id="outline-container-orgd3c530e" class="outline-2">
<h2 id="orgd3c530e"><span class="section-number-2">2</span> 问题的分析</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>题目需要一个合适的建造方案来使得公司的利润最大化。按照给定的条件，只需得到一个计算总利润的一般方程，并最大化这个结果。</li>
</ul>
</div>
</div>
<div id="outline-container-org05e0e1d" class="outline-2">
<h2 id="org05e0e1d"><span class="section-number-2">3</span> 模型的假设</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>每个电梯的成本为常量，即2万元</li>
<li>在十公里内与十公里外的情况下，地区的销售额为表中所给常量</li>
<li>在每个地区建造维修站的成本为表中所给常量</li>
</ul>
</div>
</div>
<div id="outline-container-org1c17bcb" class="outline-2">
<h2 id="org1c17bcb"><span class="section-number-2">4</span> 符号说明</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>P 总利润</li>
<li>p 每个电梯的利润</li>
<li>Ci 在第i个地区建造维修站的成本</li>
<li>Xi 在第i个地区建造维修站, 其中 Xi=1 表示在i地区修建，Xi=0 表示未在该地区修建</li>
<li>Si 第i个地区的实际销售量</li>
<li>Rij 第i个地区与第j个地区的距离</li>

<li>C 为 1x7 矩阵 第i列为Ci</li>
<li>X 为 1x7 矩阵 第i列为Xi</li>
<li>S 为 1x7 矩阵 第i列为Si</li>
<li>R 为 7*7 矩阵 第i行第j列为 Rij</li>
<li>B 为一个包含所有X的可能的集合</li>
</ul>
</div>
</div>

<div id="outline-container-org0ca85f4" class="outline-2">
<h2 id="org0ca85f4"><span class="section-number-2">5</span> 模型的建立</h2>
<div class="outline-text-2" id="text-5">
<p>
\(\max \limits_{x\subset B}P= p*\sum S - C * X'\)
</p>
</div>
</div>
<div id="outline-container-orgad35e4f" class="outline-2">
<h2 id="orgad35e4f"><span class="section-number-2">6</span> 模型的求解</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>鉴于集合B一共包含128个元素，即有128种可选的建造方案，因此，直接遍历所有可能解找出使P最大的X即可。</li>
</ul>
</div>
<div id="outline-container-org41206de" class="outline-3">
<h3 id="org41206de"><span class="section-number-3">6.1</span> 判断一个地区是否为最大销售量</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #de714f;">function</span> <span style="color: #d56bb6;">l</span> <span style="color: #F92672;">=</span> <span style="color: #e76869;">isBT</span><span style="color: #AE81FF;">(</span><span style="color: #e56494;">k</span><span style="color: #F92672;">,</span> <span style="color: #e66965;">X</span><span style="color: #AE81FF;">)</span>
  <span style="color: #00a677;">S</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">5</span> <span style="color: #AE81FF;">12</span> <span style="color: #AE81FF;">7</span> <span style="color: #AE81FF;">11</span> <span style="color: #AE81FF;">18</span> <span style="color: #AE81FF;">16</span> <span style="color: #F92672;">;</span> <span style="color: #F92672;">...</span>
       <span style="color: #AE81FF;">5</span> <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">7</span> <span style="color: #AE81FF;">11</span> <span style="color: #AE81FF;">4</span> <span style="color: #AE81FF;">11</span> <span style="color: #AE81FF;">11</span> <span style="color: #F92672;">;</span> <span style="color: #F92672;">...</span>
       <span style="color: #AE81FF;">12</span> <span style="color: #AE81FF;">7</span> <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">14</span> <span style="color: #AE81FF;">9</span> <span style="color: #AE81FF;">6</span> <span style="color: #AE81FF;">13</span> <span style="color: #F92672;">;</span> <span style="color: #F92672;">...</span>
       <span style="color: #AE81FF;">7</span> <span style="color: #AE81FF;">11</span> <span style="color: #AE81FF;">14</span> <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">5</span> <span style="color: #AE81FF;">12</span> <span style="color: #AE81FF;">12</span> <span style="color: #F92672;">;</span> <span style="color: #F92672;">...</span>
       <span style="color: #AE81FF;">11</span> <span style="color: #AE81FF;">4</span> <span style="color: #AE81FF;">9</span> <span style="color: #AE81FF;">5</span> <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">7</span> <span style="color: #AE81FF;">7</span> <span style="color: #F92672;">;</span> <span style="color: #F92672;">...</span>
       <span style="color: #AE81FF;">18</span> <span style="color: #AE81FF;">11</span> <span style="color: #AE81FF;">6</span> <span style="color: #AE81FF;">12</span> <span style="color: #AE81FF;">7</span> <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">12</span> <span style="color: #F92672;">;</span> <span style="color: #F92672;">...</span>
       <span style="color: #AE81FF;">16</span> <span style="color: #AE81FF;">11</span> <span style="color: #AE81FF;">13</span> <span style="color: #AE81FF;">12</span> <span style="color: #AE81FF;">7</span> <span style="color: #AE81FF;">12</span> <span style="color: #AE81FF;">0</span> <span style="color: #AE81FF;">]</span><span style="color: #F92672;">;</span>
  <span style="color: #d56bb6;">l</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">;</span>
  <span style="color: #a29027;">nR</span> <span style="color: #F92672;">=</span> <span style="color: #00a7bd;">Inf</span><span style="color: #F92672;">;</span>
  <span style="color: #00a2e0;">for</span> <span style="color: #a39027;">i</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">:</span><span style="color: #AE81FF;">7</span>
      <span style="color: #00a4db;">if</span> <span style="color: #e66965;">X</span><span style="color: #AE81FF;">(</span><span style="color: #a39027;">i</span><span style="color: #AE81FF;">)</span>
        <span style="color: #a29027;">nR</span> <span style="color: #F92672;">=</span> <span style="color: #6c9e3e;">min</span><span style="color: #AE81FF;">(</span><span style="color: #00a677;">S</span><span style="color: #66D9EF;">(</span><span style="color: #e56494;">k</span><span style="color: #F92672;">,</span> <span style="color: #a39027;">i</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">,</span> <span style="color: #a29027;">nR</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
      <span style="color: #c074cb;">end</span>
  <span style="color: #c074cb;">end</span>
  <span style="color: #00a4db;">if</span> <span style="color: #a29027;">nR</span><span style="color: #F92672;">&lt;=</span><span style="color: #AE81FF;">10</span>
    <span style="color: #d56bb6;">l</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">;</span>
  <span style="color: #c074cb;">end</span>
<span style="color: #c074cb;">end</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org31198ef" class="outline-3">
<h3 id="org31198ef"><span class="section-number-3">6.2</span> 得到各地区的销售量矩阵S</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #de714f;">function</span> <span style="color: #e16f55;">A</span> <span style="color: #F92672;">=</span> <span style="color: #0da567;">getAmount</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #AE81FF;">)</span>
  <span style="color: #56a14b;">Q</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">700</span> <span style="color: #AE81FF;">500</span> <span style="color: #AE81FF;">1100</span> <span style="color: #AE81FF;">800</span> <span style="color: #AE81FF;">600</span> <span style="color: #AE81FF;">1400</span> <span style="color: #AE81FF;">1600</span>  <span style="color: #F92672;">;</span> <span style="color: #F92672;">...</span>
       <span style="color: #AE81FF;">500</span> <span style="color: #AE81FF;">400</span>  <span style="color: #AE81FF;">700</span> <span style="color: #AE81FF;">600</span> <span style="color: #AE81FF;">450</span>  <span style="color: #AE81FF;">600</span>  <span style="color: #AE81FF;">700</span> <span style="color: #AE81FF;">]</span><span style="color: #F92672;">;</span>
  <span style="color: #e16f55;">A</span> <span style="color: #F92672;">=</span> <span style="color: #00a5d4;">zeros</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">1</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">7</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
  <span style="color: #00a2e0;">for</span> <span style="color: #a39027;">i</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">:</span><span style="color: #AE81FF;">7</span>
    <span style="color: #e16f55;">A</span><span style="color: #AE81FF;">(</span><span style="color: #a39027;">i</span><span style="color: #AE81FF;">)</span> <span style="color: #F92672;">=</span> <span style="color: #56a14b;">Q</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">-</span><span style="color: #e76869;">isBT</span><span style="color: #66D9EF;">(</span><span style="color: #a39027;">i</span><span style="color: #F92672;">,</span> <span style="color: #e66965;">X</span><span style="color: #66D9EF;">)</span><span style="color: #F92672;">+</span><span style="color: #AE81FF;">2</span><span style="color: #F92672;">,</span> <span style="color: #a39027;">i</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
  <span style="color: #c074cb;">end</span>
<span style="color: #c074cb;">end</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org138dee5" class="outline-3">
<h3 id="org138dee5"><span class="section-number-3">6.3</span> 计算总利润</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #de714f;">function</span> <span style="color: #00a7bb;">F</span> <span style="color: #F92672;">=</span> <span style="color: #00a3db;">getProfit</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #AE81FF;">)</span>
  <span style="color: #be852e;">C</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">240</span> <span style="color: #AE81FF;">280</span> <span style="color: #AE81FF;">220</span> <span style="color: #AE81FF;">260</span> <span style="color: #AE81FF;">380</span> <span style="color: #AE81FF;">250</span> <span style="color: #AE81FF;">200</span><span style="color: #AE81FF;">]</span><span style="color: #F92672;">;</span>
  <span style="color: #00a791;">Cost</span> <span style="color: #F92672;">=</span> <span style="color: #be852e;">C</span> <span style="color: #F92672;">*</span> <span style="color: #e66965;">X</span><span style="color: #F92672;">';</span>
  <span style="color: #e16f55;">A</span> <span style="color: #F92672;">=</span> <span style="color: #0da567;">getAmount</span><span style="color: #AE81FF;">(</span><span style="color: #e66965;">X</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
  <span style="color: #00a7bb;">F</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">2</span><span style="color: #F92672;">*</span><span style="color: #dd724d;">sum</span><span style="color: #AE81FF;">(</span><span style="color: #e16f55;">A</span><span style="color: #AE81FF;">)</span> <span style="color: #F92672;">-</span> <span style="color: #00a791;">Cost</span><span style="color: #F92672;">;</span>
<span style="color: #c074cb;">end</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd9150ee" class="outline-3">
<h3 id="orgd9150ee"><span class="section-number-3">6.4</span> 遍历所有可能方案得到最优解</h3>
<div class="outline-text-3" id="text-6-4">
</div><ol class="org-ol"><li><a id="orgdd04029"></a>所有可能方案<br /><div class="outline-text-5" id="text-6-4-0-1">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #de714f;">function</span> <span style="color: #00a7c3;">p</span> <span style="color: #F92672;">=</span> <span style="color: #d97547;">getAllP</span><span style="color: #AE81FF;">(</span><span style="color: #e066a2;">T</span><span style="color: #AE81FF;">)</span>
  <span style="color: #00a7c3;">p</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[]</span><span style="color: #F92672;">;</span>
  <span style="color: #00a4db;">if</span> <span style="color: #e066a2;">T</span> <span style="color: #F92672;">==</span> <span style="color: #AE81FF;">1</span>
    <span style="color: #00a7c3;">p</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">0</span><span style="color: #F92672;">;</span><span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">]</span><span style="color: #F92672;">;</span>
  <span style="color: #00a5d4;">else</span>
    <span style="color: #ac7bd9;">P</span> <span style="color: #F92672;">=</span> <span style="color: #d97547;">getAllP</span><span style="color: #AE81FF;">(</span><span style="color: #e066a2;">T</span><span style="color: #F92672;">-</span><span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
    <span style="color: #00a2e0;">for</span> <span style="color: #a39027;">i</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">:</span><span style="color: #b179d6;">size</span><span style="color: #AE81FF;">(</span><span style="color: #ac7bd9;">P</span><span style="color: #F92672;">,</span><span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span>
      <span style="color: #00a7c3;">p</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">[</span> <span style="color: #66D9EF;">[</span><span style="color: #ac7bd9;">P</span><span style="color: #A6E22E;">(</span><span style="color: #a39027;">i</span><span style="color: #F92672;">,:</span><span style="color: #A6E22E;">)</span> <span style="color: #AE81FF;">1</span>  <span style="color: #F92672;">;</span> <span style="color: #F92672;">...</span>
             <span style="color: #ac7bd9;">P</span><span style="color: #A6E22E;">(</span><span style="color: #a39027;">i</span><span style="color: #F92672;">,:</span><span style="color: #A6E22E;">)</span> <span style="color: #AE81FF;">0</span> <span style="color: #66D9EF;">]</span><span style="color: #F92672;">;</span> <span style="color: #00a7c3;">p</span><span style="color: #AE81FF;">]</span><span style="color: #F92672;">;</span>
    <span style="color: #c074cb;">end</span>
  <span style="color: #c074cb;">end</span>
<span style="color: #c074cb;">end</span>
</pre>
</div>
</div></li>
<li><a id="org414e531"></a>得到答案<br /><div class="outline-text-5" id="text-6-4-0-2">
<div class="org-src-container">
<pre class="src src-octave"><span style="color: #de714f;">function</span> <span style="color: #AE81FF;">[</span><span style="color: #0097f1;">n</span> <span style="color: #b8882b;">max</span><span style="color: #AE81FF;">]</span> <span style="color: #F92672;">=</span> <span style="color: #db7449;">accioAnswer</span>
  <span style="color: #ac7bd9;">P</span> <span style="color: #F92672;">=</span> <span style="color: #d97547;">getAllP</span><span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">7</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
  <span style="color: #0097f1;">n</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">0</span><span style="color: #F92672;">;</span>
  <span style="color: #b8882b;">max</span> <span style="color: #F92672;">=</span> <span style="color: #F92672;">-</span><span style="color: #00a7bd;">Inf</span><span style="color: #F92672;">;</span>
  <span style="color: #00a2e0;">for</span> <span style="color: #a39027;">i</span> <span style="color: #F92672;">=</span> <span style="color: #AE81FF;">1</span><span style="color: #F92672;">:</span><span style="color: #b179d6;">size</span><span style="color: #AE81FF;">(</span><span style="color: #ac7bd9;">P</span><span style="color: #F92672;">,</span> <span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span>
    <span style="color: #e8666f;">pprofit</span> <span style="color: #F92672;">=</span> <span style="color: #00a3db;">getProfit</span><span style="color: #AE81FF;">(</span><span style="color: #ac7bd9;">P</span><span style="color: #66D9EF;">(</span><span style="color: #a39027;">i</span><span style="color: #F92672;">,:</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span><span style="color: #F92672;">;</span>
    <span style="color: #00a4db;">if</span> <span style="color: #e8666f;">pprofit</span> <span style="color: #F92672;">&gt;</span> <span style="color: #b8882b;">max</span>
      <span style="color: #0097f1;">n</span> <span style="color: #F92672;">=</span> <span style="color: #a39027;">i</span><span style="color: #F92672;">;</span>
      <span style="color: #b8882b;">max</span> <span style="color: #F92672;">=</span> <span style="color: #e8666f;">pprofit</span><span style="color: #F92672;">;</span>
    <span style="color: #c074cb;">end</span>
  <span style="color: #c074cb;">end</span>
<span style="color: #c074cb;">end</span>
</pre>
</div>
</div></li></ol>
</div>
</div>
<div id="outline-container-org00e371c" class="outline-2">
<h2 id="org00e371c"><span class="section-number-2">7</span> 模型分析</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>模型具有局限性。模型中的销售量为定值，而实际中，销售量往往为一个随机变量。</li>
</ul>
</div>
</div>
<div id="outline-container-org55b601b" class="outline-2">
<h2 id="org55b601b"><span class="section-number-2">8</span> 模型的推广</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>令题中所给的销售额为销售额的均值，根据经验，可以假定一个销售额的方差矩阵。</li>
<li>计算总利润依然根据均值即题中所给表格数据计算。</li>
<li>假定销售额满足一个正态分布，则易得总利润满足的正态分布为实际各地区销售满足的正态分布之和。</li>
<li>由此，制定一套同时考虑方差与均值的挑选方法。例如，通过均值的平方与方差的比例作为衡量销售额水平的标准，来找出符合市场规律的最佳方案。</li>
<li>实际方案需要通过统计学习该类商品的实际销售情况得出。</li>
</ul>
</div>
</div>
<div id="outline-container-org79bfda6" class="outline-2">
<h2 id="org79bfda6"><span class="section-number-2">9</span> 参考文献</h2>
<div class="outline-text-2" id="text-9">
<p>
<i>《数学建模》 陈光亭 裘哲勇</i>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Li Jiajie</p>
<p class="date">Created: 2017-03-25 Sat 09:40</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
